In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.11688753,  2.36692585,  1.64727922],
       [-3.25003156,  0.05756952,  1.79884796],
       [-0.15296623, -0.09886244, -0.69591685],
       [ 1.2184657 ,  0.51567465, -0.40091131]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0 -0.116888  2.366926  1.647279
1 -3.250032  0.057570  1.798848
2 -0.152966 -0.098862 -0.695917
3  1.218466  0.515675 -0.400911

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Ali","Zeynep","Atlas","Mehmet"],columns=["maas","yas","calısma saati"])

In [8]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [9]:
yeniDataFrame["yas"]

Ali       2.366926
Zeynep    0.057570
Atlas    -0.098862
Mehmet    0.515675
Name: yas, dtype: float64

In [10]:
yeniDataFrame["calısma saati"]

Ali       1.647279
Zeynep    1.798848
Atlas    -0.695917
Mehmet   -0.400911
Name: calısma saati, dtype: float64

In [11]:
yeniDataFrame[["maas","yas"]]

            maas       yas
Ali    -0.116888  2.366926
Zeynep -3.250032  0.057570
Atlas  -0.152966 -0.098862
Mehmet  1.218466  0.515675

In [12]:
yeniDataFrame[:"Ali"]

         maas       yas  calısma saati
Ali -0.116888  2.366926       1.647279

In [13]:
yeniDataFrame.loc["Ali"]

maas            -0.116888
yas              2.366926
calısma saati    1.647279
Name: Ali, dtype: float64

In [14]:
yeniDataFrame.iloc[1]

maas            -3.250032
yas              0.057570
calısma saati    1.798848
Name: Zeynep, dtype: float64

In [15]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [16]:
yeniDataFrame["Emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [17]:
yeniDataFrame

            maas       yas  calısma saati  Emeklilik yasi
Ali    -0.116888  2.366926       1.647279        4.733852
Zeynep -3.250032  0.057570       1.798848        0.115139
Atlas  -0.152966 -0.098862      -0.695917       -0.197725
Mehmet  1.218466  0.515675      -0.400911        1.031349

In [18]:
yeniDataFrame.drop("Emeklilik yasi",axis=1)

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [19]:
yeniDataFrame.drop("Mehmet",axis=0)

            maas       yas  calısma saati  Emeklilik yasi
Ali    -0.116888  2.366926       1.647279        4.733852
Zeynep -3.250032  0.057570       1.798848        0.115139
Atlas  -0.152966 -0.098862      -0.695917       -0.197725

In [20]:
yeniDataFrame

            maas       yas  calısma saati  Emeklilik yasi
Ali    -0.116888  2.366926       1.647279        4.733852
Zeynep -3.250032  0.057570       1.798848        0.115139
Atlas  -0.152966 -0.098862      -0.695917       -0.197725
Mehmet  1.218466  0.515675      -0.400911        1.031349

In [21]:
yeniDataFrame.drop("Emeklilik yasi",axis=1,inplace=True)

In [22]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [23]:
yeniDataFrame[:"Ali"]

         maas       yas  calısma saati
Ali -0.116888  2.366926       1.647279

In [24]:
yeniDataFrame[:"Ali"]

         maas       yas  calısma saati
Ali -0.116888  2.366926       1.647279

In [25]:
yeniDataFrame.loc["Ali","yas"]

2.3669258529566184

In [26]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [27]:
booleamFrame = yeniDataFrame < 0

In [28]:
booleamFrame

         maas    yas  calısma saati
Ali      True  False          False
Zeynep   True  False          False
Atlas    True   True           True
Mehmet  False  False           True

In [29]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [30]:
yeniDataFrame[booleamFrame]

            maas       yas  calısma saati
Ali    -0.116888       NaN            NaN
Zeynep -3.250032       NaN            NaN
Atlas  -0.152966 -0.098862      -0.695917
Mehmet       NaN       NaN      -0.400911

In [31]:
yeniDataFrame[yeniDataFrame<0]

            maas       yas  calısma saati
Ali    -0.116888       NaN            NaN
Zeynep -3.250032       NaN            NaN
Atlas  -0.152966 -0.098862      -0.695917
Mehmet       NaN       NaN      -0.400911

In [32]:
yeniDataFrame[yeniDataFrame["yas"] > 0]

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Mehmet  1.218466  0.515675      -0.400911

In [33]:
yeniDataFrame[yeniDataFrame["calısma saati"] > 0]

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848

In [34]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [35]:
yeniDataFrame.reset_index()

    index      maas       yas  calısma saati
0     Ali -0.116888  2.366926       1.647279
1  Zeynep -3.250032  0.057570       1.798848
2   Atlas -0.152966 -0.098862      -0.695917
3  Mehmet  1.218466  0.515675      -0.400911

In [36]:
yeniDataFrame

            maas       yas  calısma saati
Ali    -0.116888  2.366926       1.647279
Zeynep -3.250032  0.057570       1.798848
Atlas  -0.152966 -0.098862      -0.695917
Mehmet  1.218466  0.515675      -0.400911

In [37]:
yeniIndeksListesi = ["Ali","Zey","Atl","Meh"]

In [38]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [39]:
yeniDataFrame

            maas       yas  calısma saati Yeni Indeks
Ali    -0.116888  2.366926       1.647279         Ali
Zeynep -3.250032  0.057570       1.798848         Zey
Atlas  -0.152966 -0.098862      -0.695917         Atl
Mehmet  1.218466  0.515675      -0.400911         Meh

In [40]:
yeniDataFrame.set_index("Yeni Indeks")

                 maas       yas  calısma saati
Yeni Indeks
Ali         -0.116888  2.366926       1.647279
Zey         -3.250032  0.057570       1.798848
Atl         -0.152966 -0.098862      -0.695917
Meh          1.218466  0.515675      -0.400911

In [41]:
yeniDataFrame

            maas       yas  calısma saati Yeni Indeks
Ali    -0.116888  2.366926       1.647279         Ali
Zeynep -3.250032  0.057570       1.798848         Zey
Atlas  -0.152966 -0.098862      -0.695917         Atl
Mehmet  1.218466  0.515675      -0.400911         Meh

In [42]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [43]:
yeniDataFrame

                 maas       yas  calısma saati
Yeni Indeks
Ali         -0.116888  2.366926       1.647279
Zey         -3.250032  0.057570       1.798848
Atl         -0.152966 -0.098862      -0.695917
Meh          1.218466  0.515675      -0.400911

In [44]:
yeniDataFrame[:"Ali"]

                 maas       yas  calısma saati
Yeni Indeks
Ali         -0.116888  2.366926       1.647279

In [45]:
yeniDataFrame.loc["Ali"]

maas            -0.116888
yas              2.366926
calısma saati    1.647279
Name: Ali, dtype: float64

In [46]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [47]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [48]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [49]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [50]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [51]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [52]:
benimCizgiFilmListem = [[40,"A"],[30,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [53]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [54]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [55]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [56]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Marge  30      C

In [57]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [58]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [59]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [60]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [61]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [67]:
data = {'Job': ['Data Mining','CEO','Lawyer','Lawyer','Data Mining','CEO'],'Labouring': ['Immanuel','Jeff','Olivia','Maria','Walker','Obi-Wan'], 'Salary': [4500,30000,6000,5250,5000,35000]}

In [68]:
df = pd.DataFrame(data)

In [69]:
SalaryGroupBy = df.groupby('Salary')

In [70]:
SalaryGroupBy.sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [71]:
SalaryGroupBy.min()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [72]:
SalaryGroupBy.max()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan